Revit 2018 API
StructuralSectionStructuralTees Constructor
Overload List
Name | Description
StructuralSectionStructuralTees(Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double) |  Obsolete.
 Creates a new instance of Structural Section Tees shape with the associated set of parameters, used to attach to structural element.
StructuralSectionStructuralTees(Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double)
 Creates a new instance of Structural Section Tees shape with the associated set of parameters, used to attach to structural element.
See Also
StructuralSectionStructuralTees Class
StructuralSectionStructuralTees Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace